qemu-user-targets/CVE-2015-2051/squashfs-root/htdocs/web/hnap/SetSmartconnectSettings.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<SetSmartconnectSettings xmlns="http://purenetworks.com/HNAP1/" >
	<Enabled></Enabled>
	<GZ_Enabled></GZ_Enabled>
</SetSmartconnectSettings>
</soap:Body>
</soap:Envelope>